{
  "statements": [
    {
      "member_id": "S000033",
      "text": "Mr. President, I rise today to speak about the devastating impact of our failed trade policies. For decades, we have pursued free trade agreements that have shipped millions of good-paying American jobs overseas. The NAFTA agreement, which I opposed, led to the closure of over 60,000 factories. We need trade policies that work for American workers, not just multinational corporations. We need tariffs to protect our domestic manufacturing base.",
      "source_date": "2024-03-15",
      "cr_page": "S1234",
      "title": "On Trade Policy and American Workers"
    },
    {
      "member_id": "W000437",
      "text": "Madam President, I want to discuss the importance of the USMCA agreement. This trade deal represents a significant improvement over NAFTA. It includes stronger labor protections, updated digital trade rules, and importantly maintains duty-free access for American agricultural exports. Free and fair trade agreements like USMCA create jobs and grow our economy. We should pursue similar agreements with other partners.",
      "source_date": "2024-03-12",
      "cr_page": "S1156",
      "title": "Benefits of the USMCA Trade Agreement"
    },
    {
      "member_id": "B000944",
      "text": "The steel industry is the backbone of Ohio and communities across the Rust Belt. When foreign countries dump cheap steel in our markets, they're not just undercutting prices - they're destroying American jobs and communities. That's why I've championed Buy American provisions and supported tariffs on steel imports. We must enforce our trade laws and protect workers from unfair foreign competition.",
      "source_date": "2024-02-28",
      "cr_page": "S987",
      "title": "Protecting the American Steel Industry"
    },
    {
      "member_id": "C001098",
      "text": "Free trade has been a cornerstone of American prosperity. When we open markets abroad, American businesses thrive and consumers benefit from lower prices and greater choice. I have concerns about tariffs that raise costs for American families and invite retaliation against our exports. We should pursue free and fair trade that opens foreign markets to American goods.",
      "source_date": "2024-03-01",
      "cr_page": "S1012",
      "title": "The Benefits of Free Trade"
    },
    {
      "member_id": "H001089",
      "text": "Missouri farmers depend on access to foreign markets. The trade war with China hurt our soybean exports and cost farmers billions in lost revenue. While I support standing up to China on intellectual property theft, we need smart trade policy that doesn't punish American agriculture. Tariffs should be targeted and temporary, not a permanent feature of our trade policy.",
      "source_date": "2024-02-15",
      "cr_page": "S876",
      "title": "Trade Policy and American Agriculture"
    },
    {
      "member_id": "W000779",
      "text": "Oregon's economy thrives on trade. Our ports handle billions in exports, and thousands of jobs depend on international commerce. I believe in free trade, but it must be fair trade. We need strong enforcement of labor and environmental standards in trade agreements. Countries that cheat shouldn't get free access to American markets.",
      "source_date": "2024-03-10",
      "cr_page": "S1098",
      "title": "Fair Trade for Oregon"
    },
    {
      "member_id": "V000128",
      "text": "Mr. President, the semiconductor shortage showed us the danger of relying on foreign supply chains for critical technologies. We must bring chip manufacturing back to America. The CHIPS Act was a good start, but we need to do more to reshore critical industries. Buy American provisions in federal procurement can help rebuild our industrial base.",
      "source_date": "2024-01-20",
      "cr_page": "S456",
      "title": "Reshoring Critical Manufacturing"
    },
    {
      "member_id": "T000476",
      "text": "North Carolina's economy benefits enormously from trade. Our state exports $34 billion in goods annually, supporting hundreds of thousands of jobs. Trade agreements open markets for our farmers, manufacturers, and technology companies. We should continue to pursue new trade agreements that create opportunities for American businesses and workers.",
      "source_date": "2024-02-01",
      "cr_page": "S567",
      "title": "Trade and North Carolina Jobs"
    },
    {
      "member_id": "B001230",
      "text": "For too long, trade agreements have been written by and for corporations, not workers. The Trans-Pacific Partnership would have accelerated the offshoring of American jobs. We need a new approach to trade that puts workers first. Any trade agreement should include enforceable labor standards and protections against currency manipulation.",
      "source_date": "2024-03-05",
      "cr_page": "S1034",
      "title": "A Worker-First Trade Policy"
    },
    {
      "member_id": "G000359",
      "text": "South Carolina's manufacturing sector has been transformed by international investment and trade. BMW, Volvo, and other companies chose our state because of our skilled workforce and access to global markets. Protectionist policies that close markets abroad would hurt, not help, American manufacturing. We need smart trade policy that keeps markets open.",
      "source_date": "2024-02-20",
      "cr_page": "S912",
      "title": "Trade and Manufacturing Investment"
    },
    {
      "member_id": "K000367",
      "text": "Minnesota exports billions in agricultural and manufactured goods each year. Our farmers and businesses depend on access to foreign markets. I support the USMCA and believe we should pursue additional trade agreements. But we must also enforce our existing agreements and hold trading partners accountable when they cheat.",
      "source_date": "2024-03-18",
      "cr_page": "S1289",
      "title": "Minnesota's Trade Economy"
    },
    {
      "member_id": "R000595",
      "text": "China's trade practices threaten American jobs and national security. They steal our intellectual property, subsidize state-owned enterprises, and manipulate their currency. We need tough tariffs and other measures to counter China's economic aggression. This isn't about protectionism - it's about defending America from an adversary that doesn't play by the rules.",
      "source_date": "2024-01-15",
      "cr_page": "S345",
      "title": "Countering China's Unfair Trade Practices"
    },
    {
      "member_id": "C001035",
      "text": "Maine's fishing and lobster industries face unfair competition from foreign imports. Other countries subsidize their fishing fleets and don't follow the same environmental standards we do. I've fought for stronger enforcement of trade rules to protect our fishing communities. American fishermen deserve a level playing field.",
      "source_date": "2024-02-25",
      "cr_page": "S967",
      "title": "Protecting Maine's Fishing Industry"
    },
    {
      "member_id": "P000449",
      "text": "Free trade has lifted millions out of poverty worldwide and created tremendous wealth in America. Our trading relationships strengthen alliances and promote stability. While we should address legitimate concerns about unfair practices, we shouldn't retreat into protectionism. That path leads to higher prices, fewer jobs, and a weaker America.",
      "source_date": "2024-03-08",
      "cr_page": "S1067",
      "title": "The Case for Free Trade"
    },
    {
      "member_id": "M001176",
      "text": "Oregon's timber industry has been devastated by unfair Canadian lumber imports. Canadian provinces subsidize their lumber producers, allowing them to undercut American mills. I've pushed for stronger tariffs on Canadian softwood lumber to protect Oregon jobs. We need trade enforcement that works for American workers, not just corporate interests.",
      "source_date": "2024-02-10",
      "cr_page": "S789",
      "title": "Fair Trade for American Timber"
    },
    {
      "member_id": "S001181",
      "text": "New Hampshire businesses, especially in our high-tech sector, depend on global supply chains and export markets. I support trade agreements that open markets and protect intellectual property. But I also believe in strong enforcement. When countries cheat on trade, we must hold them accountable.",
      "source_date": "2024-03-20",
      "cr_page": "S1345",
      "title": "Trade Policy for the Innovation Economy"
    },
    {
      "member_id": "M000355",
      "text": "Kentucky's bourbon and agricultural sectors thrive on exports. When other countries retaliate against American tariffs, our farmers and distillers pay the price. Trade wars have winners and losers, and too often working families are the losers. We need stable, predictable trade relationships that let our businesses plan and invest.",
      "source_date": "2024-01-25",
      "cr_page": "S489",
      "title": "Trade Wars and Kentucky Industry"
    },
    {
      "member_id": "W000817",
      "text": "Giant corporations have written the rules of trade for too long. These deals protect investor profits while doing nothing to protect workers or the environment. I opposed the TPP because it would have let corporations sue governments over environmental and labor laws. We need a fundamental rethink of how we approach trade.",
      "source_date": "2024-03-02",
      "cr_page": "S1023",
      "title": "Trade Policy that Works for Everyone"
    },
    {
      "member_id": "C001056",
      "text": "Texas is the number one exporting state in the nation. Our economy depends on open markets and the free flow of goods across our border. The USMCA was a good deal that updated NAFTA for the modern economy while maintaining crucial market access for Texas businesses. We should build on this success.",
      "source_date": "2024-02-08",
      "cr_page": "S756",
      "title": "Trade and the Texas Economy"
    },
    {
      "member_id": "M001169",
      "text": "American aluminum workers face unfair competition from Chinese state-subsidized producers. When China floods global markets with cheap aluminum, it drives down prices and costs American jobs. I've supported tariffs on aluminum imports to protect our workers. We can't let China's unfair practices destroy American industry.",
      "source_date": "2024-03-22",
      "cr_page": "S1378",
      "title": "Protecting American Aluminum Workers"
    }
  ]
}
